## Production: glue 🧴
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 3 to add, 1 to change, 2 to destroy
```

<details>
<summary>Show summary</summary>

|  CHANGE  |                              NAME                              |
|----------|----------------------------------------------------------------|
| add      | `aws_glue_catalog_database.operations_aws_production_raw`      |
| update   | `aws_glue_catalog_database.operations_aws_production`          |
| recreate | `aws_glue_crawler.operations_aws_production_account_tags`      |
|          | `aws_glue_crawler.operations_aws_production_cost_usage_report` |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_glue_catalog_database.operations_aws_production will be updated in-place
  ~ resource "aws_glue_catalog_database" "operations_aws_production" {
      ~ description  = "Data source path: /operations/aws/*" -> "TRANSFORMED: data source path: /operations/aws/*"
        id           = "739275439843:operations_aws_production"
        name         = "operations_aws_production"
        tags         = {}
        # (5 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_glue_catalog_database.operations_aws_production_raw will be created
  + resource "aws_glue_catalog_database" "operations_aws_production_raw" {
      + arn          = (known after apply)
      + catalog_id   = (known after apply)
      + description  = "RAW: data source path: /operations/aws/*"
      + id           = (known after apply)
      + location_uri = (known after apply)
      + name         = "operations_aws_production_raw"
      + tags_all     = {
          + "CostCentre" = "PlatformDataLake"
          + "Terraform"  = "true"
        }

      + create_table_default_permission (known after apply)
    }

  # aws_glue_crawler.operations_aws_production_account_tags must be replaced
-/+ resource "aws_glue_crawler" "operations_aws_production_account_tags" {
      ~ arn                    = "arn:aws:glue:ca-central-1:739275439843:crawler/Operations / AWS / Organization / Account Tags" -> (known after apply)
      ~ configuration          = jsonencode(
          ~ {
              ~ Version              = 1.0 -> 1
                # (2 unchanged attributes hidden)
            }
        )
      ~ database_name          = "operations_aws_production" -> "operations_aws_production_raw" # forces replacement
      ~ id                     = "Operations / AWS / Organization / Account Tags" -> (known after apply)
        name                   = "Operations / AWS / Organization / Account Tags"
      ~ role                   = "service-role/AWSGlueCrawler-DataLake" -> "arn:aws:iam::739275439843:role/service-role/AWSGlueCrawler-DataLake"
      - tags                   = {} -> null
        # (6 unchanged attributes hidden)

      - lake_formation_configuration {
          - use_lake_formation_credentials = false -> null
            # (1 unchanged attribute hidden)
        }

      - lineage_configuration {
          - crawler_lineage_settings = "DISABLE" -> null
        }

      - recrawl_policy {
          - recrawl_behavior = "CRAWL_EVERYTHING" -> null
        }

      ~ s3_target {
          - exclusions          = [] -> null
          - sample_size         = 0 -> null
            # (4 unchanged attributes hidden)
        }

      - schema_change_policy {
          - delete_behavior = "DEPRECATE_IN_DATABASE" -> null
          - update_behavior = "UPDATE_IN_DATABASE" -> null
        }
    }

  # aws_glue_crawler.operations_aws_production_cost_usage_report must be replaced
-/+ resource "aws_glue_crawler" "operations_aws_production_cost_usage_report" {
      ~ arn                    = "arn:aws:glue:ca-central-1:739275439843:crawler/Operations / AWS / Cost and Usage Report" -> (known after apply)
      - classifiers            = [] -> null
      ~ configuration          = jsonencode(
          ~ {
              ~ Version              = 1.0 -> 1
                # (2 unchanged attributes hidden)
            }
        )
      ~ database_name          = "operations_aws_production" -> "operations_aws_production_raw" # forces replacement
      ~ id                     = "Operations / AWS / Cost and Usage Report" -> (known after apply)
        name                   = "Operations / AWS / Cost and Usage Report"
      ~ role                   = "service-role/AWSGlueCrawler-DataLake" -> "arn:aws:iam::739275439843:role/service-role/AWSGlueCrawler-DataLake"
      - tags                   = {} -> null
        # (5 unchanged attributes hidden)

      - lake_formation_configuration {
          - use_lake_formation_credentials = false -> null
            # (1 unchanged attribute hidden)
        }

      - lineage_configuration {
          - crawler_lineage_settings = "DISABLE" -> null
        }

      - recrawl_policy {
          - recrawl_behavior = "CRAWL_EVERYTHING" -> null
        }

      ~ s3_target {
          - exclusions          = [] -> null
          - sample_size         = 0 -> null
            # (4 unchanged attributes hidden)
        }

      - schema_change_policy {
          - delete_behavior = "DEPRECATE_IN_DATABASE" -> null
          - update_behavior = "UPDATE_IN_DATABASE" -> null
        }
    }

Plan: 3 to add, 1 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_glue_catalog_database.operations_aws_production"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_catalog_database.operations_aws_production_raw"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_crawler.operations_aws_production_account_tags"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_crawler.operations_aws_production_cost_usage_report"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.glue_crawler"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.glue_etl"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.glue_crawler"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.glue_etl"]
WARN - plan.json - main - Missing Common Tags: ["aws_kms_key.aws_glue"]

28 tests, 19 passed, 9 warnings, 0 failures, 0 exceptions

```

</details>
